<template>
  <div class="friends-block">

    <div class="friends-block__box" v-for="item in list">
      <div class="friends-block__photo" v-lazy:background-image="require(`@/assets/images/friends/${item.photo}`)"/>
      <div class="friends-block__text-block">
        <div class="friends-block__name">{{ item.name }}</div>
        <div class="friends-block__type">{{ item.type }}</div>
        <div class="friends-block__text">"{{ item.text }}"</div>
      </div>
    </div>

  </div>
</template>

<script>
export default {
  name: "FriendsBlock",
  data: () => ({
    list: [
      {name: "Нуржас", type: "Друг Абылая", photo: "nurzhas.jpeg", text: "Детская дружба - самая крепкая, все, что я могу сказать про наши с Абылом отношения. Мы можем не видеться годами, но это никак не повлияет на наше с ним общение и прекрасное отношение друг к другу. А вообще, обожаю Вашу парочку. Приятно видеть как Вы вместе прогрессируете, растете и добиваетесь своих целей. Плечом к плечу, скрепив все это огромной любовью друг к другу. Люблю Вас пупсечки❤️"},
      {name: "Диана", type: "Подруга Аиши", photo: "diana.jpeg", text: "Для меня пара Аиши и Абыла самая гармоничная, веселая и интересная. Они два сапога пара, которые дополняют друг-друга. Если Абыл коржики торта с кремом, то Айша его мегасладкая глазурь или если Айша клубничное мороженое, то Абыл его шоколадная посыпка, но не смотря на это они оба сильные личности, которые всегда стремятся к большему. Они друг-друга мотивация, что очень важно в отношениях и за это я их сильно уважаю и люблю жандарым, буду служить на вашей свадьбе от всей души ♥️"},
      {name: "Бауыржан", type: "Друг Абылая", photo: "bauka.jpeg", text: "Отношения крепче стали. Вы соприкосновение двух разных миров."},
      {name: "Нурасыл", type: "Друг Абылая", photo: "nurik.jpeg", text: "Мне в вас нравится то, что вы не такие как все пары, а выделяетесь креативностью, находите новые испытания, и никогда не сидите без дела. С вами никогда не скучно, всегда найдется то, о чем можно поговорить."},
      {name: "Максат", type: "Друг Абылая", photo: "maksat.jpeg", text: "Абылай мой близкий человек и я дорожу им, поэтому очень рад, что его дополняет умная, интересная и красивая девушка Айша. Безумно рад за вас ребята"},
      {name: "Алуа", type: "Подруга Абылая", photo: "alua.jpeg", text: "Я обожаю эту пару за то, что они реальны. Они показывают, что гармония возможна и неустанно работают как над собой, так и друг над другом. И только это уже достойно восхищения)"},
      {name: "Темирлан", type: "Друг Абылая", photo: "kusa.jpeg", text: "Всем привет, лично знаком с Абылаем и Айшой около 7ми лет. За данный период я бы не сказал, что мы прошли через горы и моря, но тем не менее наши отношения укрепились платиновой паяльной. Очень сильно дорожу ими и хотелось бы в будущем так же вместе тянуться вверх рука об руку! Спонтанные встречи в период серой рутины всегда украшают наши посиделки и активные занятия спортом!"},
      {name: "Валентина", type: "Подруга Аиши", photo: "valya.jpeg", text: "Я бы поставила 5 звёзд с отдельным лайком за вашу проф деятельность, душевность, баскет (Абылу) и весь остальной спорт (тебе😂). Поражаюсь отдаче Аиши и думаю, что в союзе с Абылаем вы будете невероятных высот достигать, и делать это с особенным стилем"},
      {name: "Сабит", type: "Друг и коллега Аиши", photo: "sabit.jpeg", text: "Очень приятно смотреть на их общее развитие. Благодаря умелым ручкам Абыла и невероятным идеям Аиши, данная пара совместно способна свернуть многие горы."},
      {name: "Ахат", type: "Друг Аиши", photo: "ahat.jpeg", text: "Одно слово - пример. Аиша и Абылай всегда были и будут примером идеальных отношений. Их смешные видео, приятно красивые фотографии всегда греют сердце своей искренностью. Абылай настоящая мужская стена и опора для Аишы. И его действия, когда помогал ей с проектом, играл за сборную ее факультета и многое другое показывают его решительность и чувства по отношению к его половинке.Самая лучшая пара, заслуживающие огромного счастья и любви."},
      {name: "Махаббат", type: "Подруга и бывшая коллега Аиши", photo: "maha.jpeg", text: "Мне нравится, что вы дружные 😍 Я считаю, что такой и должна быть настоящая семья! Очень искренние и остроумные! Ну просто идеальная пара💔"},
      {name: "Гульназ", type: "Подруга и бывшая коллега Аиши", photo: "gulnaz.jpeg", text: "Абыла и Аишу знаю больше года. Как по мне, они очень красивая пара, прекрасно дополняют друг друга. Два абсолютно разных человека, но при этом так похожи😂 Обожаю их видео в ТикТоке, обожаю их шутки друг над другом😁"},
      {name: "Рустам", type: "Общий друг и бывший босс Аиши", photo: "rustam.jpeg", text: "Аишу и Абылая знаем давно как порядочных, отзывчивых, добрых верных слову людей. Нам посчастливилось работать вместе и мы рады что знакомы с  такими продвинутыми и умными людьми. Они стали нам как младшие брат и сестра, мы радуемся за их успехи как за свои, надеемся что в будущем нас ждут новые проекты и новые успехи вместе!"},
      {name: "Алишер и Алика", type: "Общие друзья", photo: "alishalika.jpeg", text: "Абыл и Аиша прикольные ребята. За что мы их любим? Во-первых они всегда гуляют с нами до утра. Они никогда не отказывают. Они лёгкие на подъём и за любой кипишь. Они идеальная пара. Невозможно представить их с кем-то другим. Такое чувство, что они созданы друг для друга. Они очень умные, активные и целеустремлённые."},
      {name: "Аяулым", type: "Подруга Абылая", photo: "ayau.jpeg", text: "Гармоничные, глубокие и искренние отношения — большая редкость, но я рада, что мои друзья могли построить именно такие отношения.   Без сомнений могу сказать, что их брак будет крепким, на всю жизнь, потому что Абылай  и Аиша идеально дополняют друг друга во всем."},
      // {name: "", type: "", photo: "", text: ""},
    ]
  })
}
</script>

<style lang="scss" scoped>
.friends-block {
  padding: 50px 5%;
  display: flex;
  flex-direction: column;

  &__box {
    //display: flex;
    //flex-direction: row;
    $padding: 20px;
    width: calc(100% - 2*$padding);
    max-width: 600px;
    padding: $padding;
    box-shadow: 0px 0px 18px 4px rgb(34 60 80 / 20%);
    border-radius: 5px;
    margin: 20px auto 20px 0;

    &:nth-child(even) {
      margin-left: auto;
      margin-right: 0;
      .friends-block__photo {
        float: right !important;
        margin-left: 20px;
        margin-right: 0;
      }
      //.friends-block__name {text-align: right !important;}
      //.friends-block__type {text-align: right !important;}
    }
  }

  &__name {
    font-size: 25px;
    font-weight: bold;
  }

  &__type {
    margin-bottom: 10px;
    font-size: 14px;
    color: gray;
  }

  &__text {
    font-size: 14px;
  }

  &__photo {
    float: left;
    width: 100px;
    min-width: 100px;
    height: 100px;
    background-size: cover;
    background-repeat: no-repeat;
    margin-right: 20px;
    margin-bottom: 5px;
    border-radius: 50%;
  }
}
</style>
